{
    "vocab_size": 51866,
    "num_mel_bins": 128,
    "d_model": 1280,
    "encoder_layers": 32,
    "encoder_attention_heads": 20,
    "decoder_layers": 32,
    "decoder_attention_heads": 20,
    "decoder_ffn_dim": 5120,
    "encoder_ffn_dim": 5120,
    "dropout": 0.0,
    "attention_dropout": 0.0,
    "activation_dropout": 0.0,
    "activation_function": "gelu",
    "init_std": 0.02,
    "encoder_layerdrop": 0.0,
    "decoder_layerdrop": 0.0,
    "use_cache": true,
    "num_hidden_layers": 32,
    "scale_embedding": false,
    "max_source_positions": 1500,
    "max_target_positions": 448,
    "classifier_proj_size": 256,
    "use_weighted_layer_sum": false,
    "apply_spec_augment": false,
    "mask_time_prob": 0.05,
    "mask_time_length": 10,
    "mask_time_min_masks": 2,
    "mask_feature_prob": 0.0,
    "mask_feature_length": 10,
    "mask_feature_min_masks": 0,
    "median_filter_width": 7,
    "return_dict": true,
    "output_hidden_states": false,
    "output_attentions": false,
    "torchscript": false,
    "torch_dtype": "float16",
    "use_bfloat16": false,
    "tf_legacy_loss": false,
    "pruned_heads": {},
    "tie_word_embeddings": true,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": true,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "max_length": 448,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": [220, 50257],
    "architectures": ["WhisperForConditionalGeneration"],
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 50257,
    "pad_token_id": 50256,
    "eos_token_id": 50257,
    "sep_token_id": null,
    "decoder_start_token_id": 50258,
    "task_specific_params": null,
    "problem_type": null,
    "_name_or_path": "openai/whisper-large-v3",
    "transformers_version": "4.38.2",
    "model_type": "whisper",
    "_attn_implementation":"sdpa"
}
